backend/app/Http/Controllers/Admin/AdminController.php

select count(*) as aggregate from `users` where `active` = '1'
select users.* from `users` where `active` = '0' order by `user_id` desc limit 5
select users.* from `users` where `active` = '1' order by `user_id` desc limit 5
select count(*) as total,DATE_FORMAT(created_at, "%Y-%m") AS Mon from `users` where DATE_FORMAT(created_at, '%Y-%m') >  2021-02 group by Mon order by CAST(Mon as SIGNED) asc
---
    public function index()
    {
        $candidates = DB::table('users')->where('active', '1')->count();
        $pending_candidates = DB::table('users')
            ->select(DB::raw('users.*'))
            ->where('active', '0')
            ->orderBy('user_id', 'DESC')
            ->limit(5)
            ->get();

        $active_candidates = DB::table('users')
            ->select(DB::raw('users.*'))
            ->where('active', '1')
            ->orderBy('user_id', 'DESC')
            ->limit(5)
            ->get();

        $total_active_candidates = count($active_candidates);
        $total_pending_candidates = count($pending_candidates);
        $now = date('Y-m');
        $d_arr = array();
        for ($x = 11; $x >= 0; $x--) {
            $tm = date('Y-m', strtotime($now . " -$x month"));
            $d_arr[$tm] = 0;
        }
        $register = DB::table('users')
            ->select(DB::raw('count(*) as total,DATE_FORMAT(created_at, "%Y-%m") AS Mon'))
            ->whereRaw("DATE_FORMAT(created_at, '%Y-%m') >  $tm")
            ->groupBy(DB::raw("Mon"))
            ->orderby(DB::raw("CAST(Mon as SIGNED)"))
            ->get();

select count(*) as aggregate from `videos`
select count(*) as aggregate from `videos` where `active` = 1
select count(*) as aggregate from `videos` where `active` = 0
select count(*) as aggregate from `videos` where `flag` = 1
---
            $d_arr[$data->Mon] = $data->total;
        }

        $total_videos = DB::table('videos')->count();
        $total_active_videos = DB::table('videos')->where('active', 1)->count();
        $total_inactive_videos = DB::table('videos')->where('active', 0)->count();
        $isColExist = Schema::hasColumn('videos', 'flag');
        if ($isColExist) {
            $total_flagged_videos = DB::table('videos')->where('flag', 1)->count();

select count(*) as aggregate from `users`
select count(*) as aggregate from `likes`
select count(*) as aggregate from `comments`
select count(*) as aggregate from `video_views`
select count(*) as aggregate from `sounds`
select count(*) as aggregate from `sounds` where `active` = 1
select count(*) as aggregate from `sounds` where `active` = 0
---
            $total_flagged_videos = 0;
        }

        $total_users = DB::table('users')->count();

        $total_likes = DB::table('likes')->count();
        $total_comments = DB::table('comments')->count();
        $total_views = DB::table('video_views')->count();

        $total_sounds = DB::table('sounds')->count();
        $total_active_sounds = DB::table('sounds')->where('active', 1)->count();
        $total_inactive_sounds = DB::table('sounds')->where('active', 0)->count();

select `cur_version` from `settings` limit 1
---
        $current_version = "v100";
        $isColExist = Schema::hasColumn('settings', 'cur_version');
        if ($isColExist) {
            $current_version = DB::table('settings')->select('cur_version')->first();