backend/app/Http/Controllers/Admin/CandidateController.php

select user_id,fname,lname,email,username from `users` where `active` = '0' order by `user_id` desc
---
    public function show($active=1)
    {
        $candidates = DB::table('users')
        ->select(DB::raw('user_id,fname,lname,email,username'))
        ->where('active',$active)
        ->orderBy('user_id','DESC')
        ->get();

select count(*) as total from `users` where `active` = '1' limit 1
---
    public function count_all($request)
    {
        $candidateRS = DB::table('users')->select(DB::raw("count(*) as total"))->where('active',$request->active)->first();