backend/app/Http/Controllers/Admin/CategoryController.php

select count(*) as total from `categories` where `deleted` = 0 limit 1
---
    public function count_all($request)
    {
        $candidateRS = DB::table('categories')->select(DB::raw("count(*) as total"))->where('deleted',0)->first();