backend/app/Http/Controllers/Admin/FlagVideoController.php

    public function count_all($request)
    {
        $candidateRS = DB::table('videos')->select(DB::raw("count(*) as total"))->where('flag',1)->first();
---
select count(*) as total from `videos` where `flag` = 1 limit 1