backend/app/Http/Controllers/Admin/ReportController.php

    public function count_all($request)
    {
        $candidateRS = DB::table('reports as r')->select(DB::raw("count(*) as total"))
                                ->leftJoin('users as u' , 'u.user_id','=','r.user_id')
                                ->leftJoin('videos as v' , 'r.video_id','=','v.video_id')
                                ->where('v.deleted',0)
                                ->first();
---
select count(*) as total from `reports` as `r` left join `users` as `u` on `u`.`user_id` = `r`.`user_id` left join `videos` as `v` on `r`.`video_id` = `v`.`video_id` where `v`.`deleted` = 0 limit 1