backend/app/Http/Controllers/Admin/SettingController.php

select * from `settings` where `setting_id` = 1 limit 1
---
    public function index($id=1,Request $request)
    {
        $action = 'edit';
        if(!isset($request->type) && $request->type==""){
            $type = 'G';
        }else{
            $type =$request->type;
        }
        $settings = DB::table('settings')->select(DB::raw("*"))->where('setting_id','=',1)->first();

select * from `ad_settings` limit 1
---
    public function adSettings($id=1,Request $request)
    {
        $action = 'edit';
        if(!isset($request->type) && $request->type==""){
            $type = 'G';
        }else{
            $type =$request->type;
        }
        $adSettings = DB::table('ad_settings')->select(DB::raw("*"))->first();

update `settings` set `site_name` = 'Q\'sfix', `site_address` = '<p>India</p>', `site_email` = 'support@unifysofttech.com', `site_phone` = '7878787878', `site_logo` = 'REyDBTVW3hn3me8Mplk4Hoso5xJ2zbCeSkP1yEhY.png', `watermark` = 'nU7n9E8V5WRCPLn3W4CgZkdAJZxBreHA5W5Awayc.png', `updated_at` = '2021-02-01 13:15:35' where (`setting_id` = 1) limit 1
---
    public function update(Request $request, $id=1)
    {
        $action='edit';

        // dd($request->all());
        $data = $this->_form_validation($request);
        DB::table('settings')->updateOrInsert(
        ['setting_id' => $id],
        $data);

select * from `app_settings` limit 1
select * from `app_login_page` limit 1
---
    public function  appSettings($id=1,Request $request)
    {
        $action = 'edit';
        if(isset($request->type) && $request->type!=""){
            $type=$request->type;
        }else{
            $type="A";
        }
        $id=1;
        $appSettings = DB::table('app_settings')->select(DB::raw("*"))->first();
        if(!$appSettings){
            $appSettings = (object) array('api_key' => '', 'api_user'=> '');
        }

        $appLoginSettings = DB::table('app_login_page')->select(DB::raw("*"))->first();

insert into `app_settings` (`app_setting_id`, `api_key`, `api_user`) values (1, 'qsfx1234', 'qsfx_user')
---
    public function  appSettingUpdate(Request $request)
    {
        $appData = array();
        $appData['api_key'] = is_null($request->api_key) ? '' : $request->api_key;
        $appData['api_user'] = is_null($request->api_user) ? '' : $request->api_user;

        DB::table('app_settings')->updateOrInsert(
        ['app_setting_id' => 1],
        $appData);