backend/app/Http/Controllers/Admin/SoundController.php

select cat_id,cat_name,parent_id from `categories` order by `cat_id` asc
---
    public function index()
    {
         $categories=DB::table('categories')
                    ->select(DB::raw('cat_id,cat_name,parent_id'))
                    ->orderBy('cat_id','ASC')
                    ->get();

select count(*) as total from `sounds` where `deleted` = 0 and `user_id` = 0 limit 1
---
    public function count_all($request)
    {
        $candidateRS = DB::table('sounds')->select(DB::raw("count(*) as total"))->where('deleted',0)->where('user_id',0)->first();