backend/app/Http/Controllers/Admin/UserVerifyController.php

select count(*) as total from `user_verify` where `verified` = 'A' limit 1
---
    public function count_all($request)
    {
        $candidateRS = DB::table('user_verify')->select(DB::raw("count(*) as total"))->where('verified',$request->type)->first();