backend/app/Http/Controllers/Admin/VideoController.php

    public function count_all($request)
    {
        $candidateRS = DB::table('videos')->select(DB::raw("count(*) as total"))->where('active',1)->first();
---
select count(*) as total from `videos` where `active` = 1 limit 1