backend/app/Http/Controllers/Web/WebBaseController.php

select `n`.*, `u`.`user_id`, `u`.`username`, `u`.`user_dp`, `u`.`login_type`, GROUP_CONCAT(n.notify_id SEPARATOR ',') as notify_ids, DATE_FORMAT(n.added_on, '%Y-%m-%d') as date, `uv`.`verified`, count(n.type) as notify_total from `notifications` as `n` inner join `users` as `u` on `u`.`user_id` = `n`.`notify_by` left join `user_verify` as `uv` on `uv`.`user_id` = `u`.`user_id` where (`n`.`notify_to` = 0) and `n`.`type` not in ('UF', 'UL') and `n`.`read` = 0 group by `date`, `n`.`type` order by `n`.`added_on` desc
---
    public function commonNotifications($readType = 1)
    {
        config()->set('database.connections.mysql.strict', false);
        DB::reconnect();

        $query = DB::table('notifications as n')
        ->join('users as u', 'u.user_id', 'n.notify_by')
        ->select('n.*', 'u.user_id', 'u.username', 'u.user_dp', 'u.login_type', DB::raw("GROUP_CONCAT(n.notify_id SEPARATOR ',') as notify_ids"),
                DB::raw("DATE_FORMAT(n.added_on, '%Y-%m-%d') as date"),'uv.verified')
        ->leftJoin('user_verify as uv','uv.user_id','u.user_id')
        ->selectRaw('count(n.type) as notify_total')
        ->where([['n.notify_to',  Auth::guard('web')->user()->user_id ?? 0]])   //, ['n.read', 0]])
        ->whereNotIn('n.type', ['UF', 'UL']);
        // ->whereDate('n.added_on', '>=', Carbon::now()->subDays(2)->toDateTimeString())
        // ->orWhere('n.read', 0)

        if (empty($readType)) {
            $query = $query->where('n.read', 0);
        }

        $commonNotifications = $query->orderBy('n.added_on', 'desc')
        ->groupBy('date', 'n.type')
        ->get()