backend/app/Http/Controllers/Web/WebController.php

update `notifications` set `read` = 1 where `notify_id` in ('')
select * from `videos` where `video_id` = 0 limit 1
---
    public function home(Request $request)
    {

        $notifIds = explode(',', request()->get('notify_ids'));

        if (!empty($notifIds)) {
            DB::table('notifications')
                ->whereIn('notify_id', $notifIds)
                ->update(['read' => 1,]);
        }

        $video = DB::table('videos')->where('video_id', intval(request()->get('videoId')))->first();

select v.user_id, v.video_id,u.username, v.video,v.title, v.thumb, v.gif, v.total_likes, v.total_comments, v.total_views, ifnull(l.like_id, 0) as liked,uv.verified as verified,u.user_dp,CONCAT(u.fname," ",u.lname) as name,v.total_comments from `videos` as `v` left join `likes` as `l` on `l`.`video_id` = `v`.`video_id` and  l.user_id=0 left join `user_verify` as `uv` on `uv`.`user_id` = `v`.`user_id` left join `users` as `u` on `u`.`user_id` = `v`.`user_id` where (`v`.`active` = 1 and `v`.`enabled` = 1) order by `v`.`video_id` desc limit 9 offset 0
select count(*) as aggregate from `videos` as `v` left join `likes` as `l` on `l`.`video_id` = `v`.`video_id` and  l.user_id=0 left join `user_verify` as `uv` on `uv`.`user_id` = `v`.`user_id` left join `users` as `u` on `u`.`user_id` = `v`.`user_id` where (`v`.`active` = 1 and `v`.`enabled` = 1)
---
                    ->leftJoin('user_verify as uv','uv.user_id','=','v.user_id')
                    ->leftJoin('users as u','u.user_id','=','v.user_id')
                    ->orderBy('v.video_id','desc')
                    // ->orderBy('v.total_likes')->orderBy('v.total_views')
                    ->where(['v.active' => 1, 'v.enabled' => 1])
                    ->skip($offset)->take($limit)->get();
                    // ->paginate($limit);
        $videosCount = DB :: table('videos as v')
        ->leftJoin('likes as l', function ($join)use ($user_id){
            $join->on('l.video_id','=','v.video_id')
                ->whereRaw(DB::raw(" l.user_id=".$user_id ));
            })
        ->leftJoin('user_verify as uv','uv.user_id','=','v.user_id')
        ->leftJoin('users as u','u.user_id','=','v.user_id')
        ->orderBy('v.total_likes')->orderBy('v.total_views')
        ->where(['v.active' => 1, 'v.enabled' => 1])
        ->count();

select * from `home_settings` limit 1
---
            $sharedVideoId = request()->get('videoId');
            $sharedVideoSrc = asset(Storage::url('public/videos/' . $video->user_id . '/' . $video->video ));
        }
        $home_data=DB::table('home_settings')->first();