backend/app/Helpers/Common/Functions.php

select `site_logo` from `settings` where `setting_id` = 1 limit 1
---
    public static function getLogo(){
        $settings = DB::table('settings')->select("site_logo")->where("setting_id",1)->first();

select `white_logo` from `home_settings` where `home_setting_id` = 1 limit 1
---
    public static function getFrontWhiteLogo(){
        $settings = DB::table('home_settings')->select("white_logo")->where("home_setting_id",1)->first();

select `logo` from `home_settings` where `home_setting_id` = 1 limit 1
---
    public static function getFrontLogo(){
        $settings = DB::table('home_settings')->select("logo")->where("home_setting_id",1)->first();

select * from `social_settings` where `social_setting_id` = 1 limit 1
---
    public static function checkSocialLogin(){
        $social=array();
        $settings = DB::table('social_settings')->where("social_setting_id",1)->first();

select `site_title` from `home_settings` where `home_setting_id` = 1 limit 1
---
    public static function getSiteTitle(){
        $isColExist = Schema::hasColumn('home_settings','site_title');
        $site_title = "Leuke";
        if($isColExist){
            $settings = DB::table('home_settings')->select("site_title")->where("home_setting_id",1)->first();

select u.user_id,u.username,u.fname,u.lname,u.user_dp,ifnull(f2.follow_id,0) as follow,uv.verified from `users` as `u` left join `user_verify` as `uv` on `uv`.`user_id` = `u`.`user_id` left join `follow` as `f2` on `u`.`user_id` = `f2`.`follow_to` and `f2`.`follow_by` = 0 where `u`.`user_id` != 0 group by u.user_id,u.username,u.fname,u.lname,u.user_dp order by `user_id` desc limit 5
---
    public static function getSuggestionAccount(){
        if(Auth::user()){
            $id=Auth::user()->user_id;
        }else{
            $id=0;
        }

        $records=DB::table('users as u')
            ->select(DB::raw('u.user_id,u.username,u.fname,u.lname,u.user_dp,ifnull(f2.follow_id,0) as follow,uv.verified'))
            ->leftJoin('user_verify as uv','uv.user_id','u.user_id')
            ->leftJoin('follow as f2', function ($join) use($id){
                $join->on('u.user_id','=','f2.follow_to')
                ->where('f2.follow_by', $id);
            })
            ->where('u.user_id','!=', $id)
            ->groupBy(DB::raw('u.user_id,u.username,u.fname,u.lname,u.user_dp'))
            ->orderBy('user_id','desc')
            ->limit(5)
            ->get();

select * from `social_media_links` limit 1
---
    public static function getSocialMediaLinks(){


        $links=DB::table('social_media_links')
            ->select(DB::raw('*'))
            ->first();

select * from `sponsors` where `active` = 1
---
    public static function getSponsors(){


        $sponsors=DB::table('sponsors')
            ->select(DB::raw('*'))
            ->where('active',1)
            ->get();

select main_color from `home_settings` limit 1
---
    public static function getTopbarColor(){
        $color=DB::table('home_settings')
            ->select(DB::raw('main_color'))
            ->first();

select `cur_version` from `settings` where `setting_id` = 1 limit 1
---
    public static function getCurrentVersion(){
        $cur_version = "v2.0";

        $settings = DB::table('settings')->select("cur_version")->where("setting_id",1)->first();