backend/app/Http/Controllers/API/adController.php

    public function index(Request $request){

        $ad_info = DB::table("ad_settings")->select(DB::raw("*"))->first();
---
select * from `ad_settings` limit 1