backend/app/Http/Controllers/API/AppController.php

select * from `app_login_page` limit 1
---
    public function index(){

        $app_login_page = DB::table("app_login_page")->select(DB::raw("*"))->first();