backend/app/Http/Controllers/API/RegisterController.php

select user_id,password,username,fname,lname,email,user_dp from `users` where email = 'demo@unifysofttech.com' limit 1
select user_id,app_token,active from `users` where email = 'demo@unifysofttech.com' and email_verified= 1  limit 1
---
    public function login(Request $request){
        $validator = Validator::make($request->all(), [
            'email'          => 'required|email',
            'password'       => 'required',
        ],
        [
            'email.required'   => 'Email is required',
            'email.email'      => 'Email id is not valid',
        ]);

        if(!$validator->passes()) {
            return response()->json(['status'=>'error','msg'=> $this->_error_string($validator->errors()->all())]);
        }else{
            $functions = new Functions();


            $existingRecord = DB::table('users')
            ->select(DB::raw("user_id,password,username,fname,lname,email,user_dp"))
            ->whereRaw(DB::raw("email = '".$request->email."'"))
            ->first();
            if($existingRecord) {
                $checkIfActive = DB::table('users')
                ->select(DB::raw("user_id,app_token,active"))
                ->whereRaw(DB::raw("email = '".$request->email."' and email_verified= 1 "))
                ->first();

update `users` set `app_token` = 'yN5VJJUP9j4We1nVp./7eIW1P9Oa8SyCE11U.bF92nrm6Pcucnfu', `time_zone` = 'Unknown', `updated_at` = '2021-02-02 06:54:59' where `user_id` = 5
---
                                'time_zone'         => $request->time_zone,
                                'updated_at'        => $now
                            );
                            DB::table('users')
                            ->where('user_id', $existingRecord->user_id)
                            ->update($data);

select *,ifnull(dob,'2008-02-02') as dob,ifnull(bio,'') as bio from `users` where `user_id` = '5' limit 1
---
    public function fetchUserInformation(Request $request){
		$validator = Validator::make($request->all(), [
            'user_id'          => 'required'
        ],[
            'user_id.required' => 'User is required'
        ]);

        if (!$validator->passes()) {
            return response()->json(['status'=>'error','msg'=> $this->_error_string($validator->errors()->all())]);
        }else{
	        $userRecord = DB::table('users')
	            ->select(DB::Raw("*,ifnull(dob,'".date('Y-m-d', strtotime('-13 years'))."') as dob,ifnull(bio,'') as bio"))
	            ->where('user_id',$request->user_id)
	            ->first();

select * from `users` where `user_id` = 5 limit 1
---
    public function updateUserInformation(Request $request){
		$validator = Validator::make($request->all(), [
            'app_token'          => 'required',
            'username'          => 'required',
            'user_id'          => 'required',
            'name'          => 'required',
            'email'          => 'required',
            'mobile'          => 'required',
            'gender'          => 'required',
            'dob'          => 'required',
        ],[
            'username.required' => 'Username is required',
            //'username.unique' => 'Username is already taken, try another one.',
            'user_id.required' => 'User Id is required',
            'name.required' => 'Name is required',
            'email.required' => 'Email is required',
            'mobile.required' => 'Mobile is required',
            'gender.required' => 'Gender is required',
            'dob.required' => 'DOB is required',
        ]);

        if (!$validator->passes()) {
            return response()->json(['status'=>'error','msg'=> $this->_error_string($validator->errors()->all())]);
        }else{
            $functions = new Functions();
            $token_res= $functions->validate_token($request->user_id,$request->app_token);
            if($token_res>0){
    	        $userRecord = DB::table('users')
    	            ->select("*")
    	            ->where('user_id',$request->user_id)
    	            ->first();

update `users` set `username` = 'unify', `fname` = 'Unify', `lname` = 'Demo', `email` = 'demo@unifysofttech.com', `mobile` = '7878787878', `bio` = '', `gender` = 'f', `dob` = '2008-02-02' where `user_id` = 5
select * from `users` where `user_id` = 5 limit 1
---
    	        	    $lname = '';
    	        	}

    				DB::table('users')
                            ->where('user_id', $userRecord->user_id)
                            ->update(['username' => $request->username,'fname' => $fname,'lname' => $lname,'email' => $request->email,'mobile' => $request->mobile,'bio' => $request->bio,'gender' => $request->gender,'dob' => date('Y-m-d',strtotime($request->dob))]);

                    $user = DB::table('users')
    	            ->select("*")
    	            ->where('user_id',$userRecord->user_id)
    	            ->first();