backend/app/Http/Controllers/API/UserController.php

select count(*) as aggregate from `videos` as `v` inner join `users` as `u` on `v`.`user_id` = `u`.`user_id` left join `user_verify` as `uv` on `uv`.`user_id` = `u`.`user_id` left join `sounds` as `s` on `s`.`sound_id` = `v`.`sound_id` where `v`.`deleted` = 0 and `v`.`user_id` = '5' and `v`.`enabled` = 1
select user_dp,user_id,fname,lname from `users` where `user_id` = '5' limit 1
---
	public function fetchLoginUserInformation(Request $request){
		$validator = Validator::make($request->all(), [
			'user_id'          => 'required',
		],[
			'user_id.required'      => 'User id is required',
		]);

		if (!$validator->passes()) {
			return response()->json(['status'=>'error','msg'=> $this->_error_string($validator->errors()->all()) ]);
		}else{
		    $functions = new Functions();
			$token_res= $functions->validate_token($request->user_id,$request->app_token);

			if($token_res>0){

				$videoStoragePath  = asset(Storage::url("public/videos"));
				$limit=9;
				$userVideos = DB::table("videos as v")
				->select(DB::raw("video_id,case when v.user_id = 0  then concat('".$videoStoragePath."/',video) else concat('".$videoStoragePath."/',v.user_id,'/',video) end as video,case when thumb='' then '' else concat('".$videoStoragePath."/',v.user_id,'/thumb/',thumb) end as thumb,ifnull(case when gif='' then '' else concat('".$videoStoragePath."/',v.user_id,'/gif/',gif) end,'') as gif,ifnull(s.title,'') as sound_title,concat('@',u.username) as username,v.duration,v.user_id,v.tags,ifnull(v.created_at,'NA') as created_at,ifnull(v.updated_at,'NA') as updated_at,(CASE WHEN v.total_views >= 1000000000
					THEN concat(FORMAT(v.total_views/1000000000,2),' ','B')
					WHEN v.total_views >= 1000000
					THEN concat(FORMAT(v.total_views/1000000,2),' ','M')
					WHEN v.total_views >= 1000
					THEN concat(FORMAT(v.total_views/1000,2),' ','K')
					ELSE
					v.total_views
					END) as total_views,(CASE WHEN v.total_likes >= 1000000000
					THEN concat(FORMAT(v.total_likes/1000000000,2),' ','B')
					WHEN v.total_likes >= 1000000
					THEN concat(FORMAT(v.total_likes/1000000,2),' ','M')
					WHEN v.total_likes >= 1000
					THEN concat(FORMAT(v.total_likes/1000,2),' ','K')
					ELSE
					v.total_likes
					END) as total_likes,
					IF(uv.verified='A', true, false) as isVerified"))
				->join("users as u","v.user_id","u.user_id")
				->leftJoin("user_verify as uv","uv.user_id","u.user_id")
				->leftJoin("sounds as s","s.sound_id","v.sound_id")
				->where("v.deleted",0)
				->where("v.user_id",$request->user_id)
				->where("v.enabled",1)
				->orderBy("v.video_id",'desc');

				$userVideos = $userVideos->paginate($limit);
				$totalVideos = $userVideos->total();
				$userRecord = DB::table('users')
				->select(DB::raw("user_dp,user_id,fname,lname"))
				->where('user_id',$request->user_id)
				->first();

select count(*) as totalFollowers from `follow` where `follow_to` = '5' limit 1
---
					}
				}

				$userFollowers = DB::table("follow")
				->select(DB::raw("count(*) as totalFollowers"))
				->where("follow_to",$request->user_id)
				->first();

select count(*) as totalFollowing from `follow` where `follow_by` = '5' limit 1
---
					$totalFollowers = Functions::digitsFormate($userFollowers->totalFollowers);
				}

				$userFollowings = DB::table("follow")
				->select(DB::raw("count(*) as totalFollowing"))
				->where("follow_by",$request->user_id)
				->first();

select ifnull(sum(total_likes),0) as totalVideosLike from `videos` where `deleted` = 0 and `user_id` = '5' limit 1
---
					$totalFollowing = Functions::digitsFormate($userFollowings->totalFollowing);
				}

				$userVideosLikes = DB::table("videos")
				->select(DB::raw("ifnull(sum(total_likes),0) as totalVideosLike"))
				->where("deleted",0)
				->where("user_id",$request->user_id)
				->first();

select verified from `user_verify` where `user_id` = '5' limit 1
---
					$totalVideosLike = Functions::digitsFormate($userVideosLikes->totalVideosLike);
				}
				$verified_status=0;
				$userVerify = DB::table("user_verify")
					->select(DB::raw("verified"))
					->where("user_id",$request->user_id)
					->first();

select concat('@',username) as username from `users` where `user_id` = '5' limit 1
---
					$verified_status=1;
				}

				$userNameRes = DB::table("users")
					->select(DB::raw("concat('@',username) as username"))
					->where("user_id",$request->user_id)
					->first();

select case when front_idproof !='' THEN case when INSTR(front_idproof,'https://') > 0 THEN front_idproof ELSE concat('http://localhost/storage/id_proof/',user_id,'/',front_idproof)  END ELSE '' END as document1,case when back_idproof !='' THEN case when INSTR(back_idproof,'https://') > 0 THEN back_idproof ELSE concat('http://localhost/storage/id_proof/',user_id,'/',back_idproof)  END ELSE '' END as document2,name,address,user_id,rejected_reason,added_on,verified from `user_verify` where `user_id` = '5' order by `user_verify_id` desc limit 1
---
	public function verifyStatusDetail(Request $request){
		$validator = Validator::make($request->all(), [
			'user_id'          => 'required',
			'app_token'          => 'required'
		],[
			'user_id.required'   => 'User Id  is required.',
			'app_token.required'   => 'App Token  is required.'

		]);

		if (!$validator->passes()) {
			return response()->json(['status'=>'error','msg'=> $this->_error_string($validator->errors()->all()) ]);
		}else{
			$functions = new Functions();
			$token_res= $functions->validate_token($request->user_id,$request->app_token);
			if($token_res>0) {
				$path=asset(Storage::url('public/id_proof/'));
				$userDetail=DB::table('user_verify')->select(DB::raw("case when front_idproof !='' THEN case when INSTR(front_idproof,'https://') > 0 THEN front_idproof ELSE concat('".$path."/',user_id,'/',front_idproof)  END ELSE '' END as document1,case when back_idproof !='' THEN case when INSTR(back_idproof,'https://') > 0 THEN back_idproof ELSE concat('".$path."/',user_id,'/',back_idproof)  END ELSE '' END as document2,name,address,user_id,rejected_reason,added_on,verified"))->where('user_id',$request->user_id)->orderBy('user_verify_id','desc')->first();