backend/app/Http/Controllers/API/VideoController.php

            }

            $login_id = $request->login_id;
            $followingVideos = DB::table("follow")
            ->select(DB::raw("follow_id"))
            ->where("follow_by",$request->login_id)
            ->first();
---
select follow_id from `follow` where `follow_by` = '5' limit 1

    public function videoLikes(Request $request){
        $validator = Validator::make($request->all(), [
            'user_id'          => 'required',
            'app_token'        => 'required',
            'video_id'    => 'required'
        ],[
            'user_id.required'      => 'User Id is required',
            'app_token.required'    => 'App Token is required',
            'video_id.required'      => 'Video id is required',
        ]);

        if (!$validator->passes()) {
            return response()->json(['status'=>'error','msg'=> $this->_error_string($validator->errors()->all()) ]);
        }else{
            $functions = new Functions();
            $token_res= $functions->validate_token($request->user_id,$request->app_token);
            $total_likes = 0;
            if($token_res>0){

                $fetchTotalVideoLikes = DB::table("videos")
                ->select(DB::raw("total_likes"))
                ->where("video_id",$request->video_id)
                ->first();

                $total_likes = $fetchTotalVideoLikes->total_likes;
                $checkExistLike = DB::table("likes")
                ->select("like_id")
                ->where("user_id",$request->user_id)
                ->where("video_id",$request->video_id)
                ->first();
---
select total_likes from `videos` where `video_id` = '31' limit 1
select `like_id` from `likes` where `user_id` = '5' and `video_id` = '31' limit 1

                    $insertData['user_id'] = $request->user_id;
                    $insertData['video_id'] = $request->video_id;
                    $insertData['liked_on'] = date("Y-m-d H:i:s");
                    DB::table("likes")->insert($insertData);
                    $total_likes = $total_likes + 1;
                    $response = array("status" => "success",'is_like'=>1 , 'total_likes' => Functions::digitsFormate($total_likes));
                }
                DB::table("videos")->where('video_id',$request->video_id)->update(['total_likes' => $total_likes]);
---
insert into `likes` (`user_id`, `video_id`, `liked_on`) values ('5', '31', '2021-02-02 11:00:42')
update `videos` set `total_likes` = 1 where `video_id` = '31'

    public function addComment(Request $request){
        $validator = Validator::make($request->all(), [
            'user_id'          => 'required',
            'app_token'        => 'required',
            'video_id'    => 'required',
            'comment' => 'required',
        ],[
            'user_id.required'      => 'User Id is required',
            'app_token.required'    => 'App Token is required',
            'video_id.required'      => 'Video id is required',
            'comment.required'      => 'Comment is required',
        ]);

        if (!$validator->passes()) {
            return response()->json(['status'=>'error','msg'=> $this->_error_string($validator->errors()->all()) ]);
        }else{
            $functions = new Functions();
            $token_res= $functions->validate_token($request->user_id,$request->app_token);
            if($token_res>0){

                $fetchTotalVideoComments = DB::table("videos")
                ->select(DB::raw("total_comments"))
                ->where("video_id",$request->video_id)
                ->first();
---
select total_comments from `videos` where `video_id` = '32' limit 1

                $data['comment'] = $request->comment;
                $data['added_on'] = date("Y-m-d H:i:s");
                $data['updated_on'] = date("Y-m-d H:i:s");
                $c_id=DB::table("comments")->insertGetId($data);
                DB::table("videos")->where('video_id',$request->video_id)->update(['total_comments' => $total_comments]);
---
insert into `comments` (`video_id`, `user_id`, `comment`, `added_on`, `updated_on`) values ('32', '5', 'sasasa', '2021-02-02 06:57:52', '2021-02-02 06:57:52')
update `videos` set `total_comments` = 1 where `video_id` = '32'

    public function fetchVideoComments(Request $request){
        $validator = Validator::make($request->all(), [
            'video_id'    => 'required'
        ],[
            'video_id.required'      => 'Video id is required',
        ]);

        if (!$validator->passes()) {
            return response()->json(['status'=>'error','msg'=> $this->_error_string($validator->errors()->all()) ]);
        }else{
            $functions = new Functions();
            $limit = 10;
            $comments = DB::table("comments as c")
            ->select(DB::raw("c.*,u.user_id,u.username,u.user_dp,IF(uv.verified='A', true, false) as isVerified"))
            ->join("users as u","c.user_id","u.user_id")
            ->leftJoin("user_verify as uv","uv.user_id","c.user_id")
            ->where("c.video_id",$request->video_id)
            ->where("c.active",1)
            ->orderBy("c.added_on","desc")
            ->paginate($limit);
---
select count(*) as aggregate from `comments` as `c` inner join `users` as `u` on `c`.`user_id` = `u`.`user_id` left join `user_verify` as `uv` on `uv`.`user_id` = `c`.`user_id` where `c`.`video_id` = '32' and `c`.`active` = 1

    public function hashTagVideos(Request $request){

        $userDpPath = asset(Storage::url('public/profile_pic'));
        $videoStoragePath  = asset(Storage::url("public/videos"));
        $limit = 9;
        $videos = DB::table("videos as v")->select(DB::raw("v.video_id,v.user_id, case when u.user_dp!='' THEN case when INSTR(u.user_dp,'https://') > 0 THEN u.user_dp ELSE concat('".$userDpPath."/',v.user_id,'/small/',u.user_dp) END ELSE '' END as user_dp,ifnull(case when thumb='' then '' else concat('".$videoStoragePath."/',v.user_id,'/thumb/',thumb) end,'') as thumb,concat('@',u.username) as username,
            v.tags,IF(uv.verified='A', true, false) as isVerified"))
        ->join("users as u","v.user_id","u.user_id")
        ->leftJoin("user_verify as uv","uv.user_id","u.user_id")
        ->where("v.deleted",0)
        ->where("v.enabled",1)
        ->where("v.user_id",'<>',$request->user_id);

        if($request->user_id > 0) {
            $videos = $videos->leftJoin('blocked_users as bu', function ($join)use ($request){
                $join->on('v.user_id','=','bu.user_id')->orOn('v.user_id','=','bu.blocked_by')
                ->whereRaw(DB::raw(" (bu.blocked_by=".$request->user_id." OR bu.user_id=".$request->user_id.")" ));
            });
            $videos = $videos->whereRaw( DB::Raw(' bu.block_id is null '));
        }
        if(isset($request->search) && $request->search!=""){
            $search = $request->search;
            $videos = $videos->whereRaw(DB::raw("((v.title like '%" . $search . "%') or (v.tags like '%" . $search . "%') or (concat('@',u.username) like '%" . $search . "%') or (u.fname like '%" . $search . "%') or (u.lname like '%" . $search . "%') or (v.description like '%" . $search . "%'))"));
        }
        $videos = $videos->orderBy("v.video_id","desc");
        $videos= $videos->paginate($limit);
        $total_records=$videos->total();

        $tagBannersPath = asset(Storage::url('public/banners'));
        $videoTagBanners = DB::table("video_tags")
        ->select(DB::raw("tag_id,tag as tag_name,concat('".$tagBannersPath."/',banner) as banner"))
        ->orderBy("tag_id","desc")
        ->get();
---
select count(*) as aggregate from `videos` as `v` inner join `users` as `u` on `v`.`user_id` = `u`.`user_id` left join `user_verify` as `uv` on `uv`.`user_id` = `u`.`user_id` left join `blocked_users` as `bu` on `v`.`user_id` = `bu`.`user_id` or `v`.`user_id` = `bu`.`blocked_by` and  (bu.blocked_by=5 OR bu.user_id=5) where `v`.`deleted` = 0 and `v`.`enabled` = 1 and `v`.`user_id` <> '5' and  bu.block_id is null
select v.video_id,v.user_id, case when u.user_dp!='' THEN case when INSTR(u.user_dp,'https://') > 0 THEN u.user_dp ELSE concat('http://localhost/storage/profile_pic/',v.user_id,'/small/',u.user_dp) END ELSE '' END as user_dp,ifnull(case when thumb='' then '' else concat('http://localhost/storage/videos/',v.user_id,'/thumb/',thumb) end,'') as thumb,concat('@',u.username) as username,
v.tags,IF(uv.verified='A', true, false) as isVerified from `videos` as `v` inner join `users` as `u` on `v`.`user_id` = `u`.`user_id` left join `user_verify` as `uv` on `uv`.`user_id` = `u`.`user_id` left join `blocked_users` as `bu` on `v`.`user_id` = `bu`.`user_id` or `v`.`user_id` = `bu`.`blocked_by` and  (bu.blocked_by=5 OR bu.user_id=5) where `v`.`deleted` = 0 and `v`.`enabled` = 1 and `v`.`user_id` <> '5' and  bu.block_id is null  order by `v`.`video_id` desc limit 9 offset 0
select tag_id,tag as tag_name,concat('http://localhost/storage/banners/',banner) as banner from `video_tags` order by `tag_id` desc

                DATE(`viewed_on`) = '".date('Y-m-d')."'  limit 1");
    //   dd($check_view);
            $views=0;
            $views_res = DB::table('videos')
            ->select(DB::raw('total_views'))
            ->where('video_id',$request->video_id)
            ->first();
---
select total_views from `videos` where `video_id` = '7' limit 1

    public function getWatermark(Request $request){
        $watermark = DB::table('settings')->first();
---
select * from `settings` limit 1